---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationName(System.Int32)
source: html/7f3081d2-948e-af1a-ef49-8d6e04ae6090.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetSpecificationName Method

Gets the specification name from its identifier.

## Syntax (C#)
```csharp
public string GetSpecificationName(
	int specId
)
```

## Parameters
- **specId** (`System.Int32`) - The specification identifier.

## Returns
The specification name;